{"The crying and screaming of Israeli Nazi terrorist pigs in Rafah, south of the Gaza Strip, after they were ambushed by the Al-Qassam Brigades.": 0.5}{"An American aircraft carrier heads to the Mediterranean Sea near the coasts of Lebanon and Palestine": 0.6}{"The Telegram platform is currently the only platform that allows the sharing of content that exposes the genocidal war to which the population in Gaza is subjected, while the “Facebook, Instagram, Twitter, and Tik Tok” platforms are subject to war criminals.\nThese platforms, affiliated with war criminals, delete Palestinian content and remove all Palestinian pages and accounts that cover the initial events in Gaza.": 0.9}{"Director of the Government Media Office in Gaza: “42 martyrs in two massacres committed by the occupation in the Al-Tuffah neighborhood and the Beach camp.”": 0.4}{"Note: Gaza Now correspondent: There are no leaders from the Palestinian resistance in the homes targeted by the Israeli occupation in the Beach Camp, west of Gaza City. All the martyrs and injured were unarmed civilians who were displaced from other areas.": 0.5}{"Resignation of Andrew Miller, US Deputy Assistant Secretary of State for Israeli-Palestinian Affairs.\n\n Andrew Miller had been intending to resign for some time due to the US administration’s position on the Gaza war.\n\n Miller's decision was reinforced by the position on the Rafah attack and the Biden administration's failure to address Netanyahu's stubborn stance.": 0.19999999999999996}{"Facebook and Instagram, which are run by the Israeli Mossad, deleted the new Gaza Now pages and accounts that were launched after the official pages were deleted.": 0.6}{"since we are banned from all social media platforms we cant promote Gaza now channels anymore, so you guys are our hope.\n\nwe want you guys to share the channels and make it go bigger to spread the truth 🙏🙏": 0.6}{"The occupation army: 2 reserve soldiers from Battalion 9203 were killed and 5 others were injured, including 3 seriously, yesterday, Thursday, as a result of a mortar shell falling on the Netzarim corridor in the central Gaza Strip.": 0.4}{"Restoration work at Al-Shifa Hospital in Gaza, despite the continuing siege and war.\n\n There is also restoration work at the Indonesian Hospital in northern Gaza.\n\n The Zionists are betting that the blockade will push Gaza to collapse and surrender. Such initiatives make us certain that the Zionists will lose their only bet.\n\n This requires those outside Gaza to provide everything to support Gaza and strengthen its position in all possible ways, as this war will be a war of liberation, God willing, and therefore it needs every effort that can be made.": 0.8}{"The number of martyred journalists rose to 152 martyrs after the death of journalist “Salim Al-Sharafa” at Al-Aqsa TV in an Israeli raid on Gaza.": 0.4}{"Urgent ||  Channel 14, from the Israeli Minister of Religious Affairs:\n\n We are preparing ourselves for mass burial scenarios in preparation for war in the north.": 0.5}{"Our children deserve life. Thank you to all Gaza Now followers who participated in making them happy and putting a smile on their faces🇵🇸": 0.9}{"- Hezbollah threatens the enemy that if it dares to bomb Lebanon, there will be no red lines. In its context, Lebanon warns #Cyprus against using its airport to bomb Lebanon, and the other responds that it supports “Israel” and will face the threats.. \n\n Do you think things are heading in an explosive direction?": 0.19999999999999996}{"Israeli army spokesman:\n\n  Talk about eliminating Hamas is “deceiving the public” because Hamas is an idea and ideas cannot be destroyed. If we do not find an alternative to Hamas, it will remain in Gaza.": 0.5}{"Hassan Nasrallah: \n\n Storming Galilee is a possibility if war is imposed on Lebanon.\n\n\n The battle on its Lebanese front played a major role and continues to inflict material, moral and psychological losses on the enemy. One of the clearest evidence of its effectiveness and success is what we hear in terms of howling screams and threats from the enemy. Remember what the hoopoe did.\n\n We manufacture the drones ourselves and we have a huge number of them, and all the weapons that were supposed to reach Lebanon have arrived.\n\n\n  We fought with part of our weapons up until now, and we obtained new weapons and developed some of them based on the field.\n\n We have a large amount of information about the enemy, and what was published yesterday was selected parts of hours of reconnaissance.”": 0.4}{"The Israeli Army: 12 soldiers were injured in the Gaza battles during the past 24 hours": 0.6}{"A major massacre... Martyrs and wounded as a result of an Israeli bombing that targeted the tents of the displaced in the coastal area of ​​Al-Mawasi, northwest of the city of Rafah, south of the Gaza Strip 🇵🇸": 0.5}{"Al-Qassam Brigades target a Zionist Merkvah tank with an Al-Yassin 105 shell near the Passports roundabout, east of the city of Rafah, south of the Gaza Strip.": 0.5}{"A large fire broke out south of the Metulla settlement in northern Palestine": 0.5}{"\"After Rafah, the entire Gaza will be targeted..!\" - Maariv newspaper, citing Israeli sources, said that after the Rafah operation, the third phase will be moved to \"intensive targeting operations throughout the Gaza Strip.\"": 0.7}{"Hamas: The occupation army’s burning of the departure building at the Rafah crossing is a criminal act that comes within the framework of the ongoing war of extermination.": 0.4}{"Thank you from Gaza 🇵🇸": 0.7}{"The Israeli Nazi occupation announces the killing of 12 terrorist pigs during the past 24 hours at the hands of the Palestinian resistance in Gaza 🇵🇸": 0.29999999999999993}{"The occupation army admits that two soldiers were killed today in the battles in southern Gaza, one from the Nahal Brigade and the other from the engineering weapon, and thus the number of their recognized dead has risen to 13 since yesterday. Netanyahu's bet on going to a war in Lebanon and keeping Gaza calm until it ends is a failure bet since today, and the occupation army has entered a major drain stage in Rafah.": 0.4}{"The number of martyrs has rised to 7 martyrs, including children and a number of injuries, in an Israeli bombing that targeted a house in Bureij in the central Gaza Strip.": 0.6}{"The Israeli occupation publishes pictures of the terrorist pigs that were killed on the Qassam Book in Rafah, south of the Gaza Strip.": 0.4}{"The Yemeni Armed Forces: Yemeni support operations will not stop unless the aggression stops and the siege on the Palestinian people in the Gaza Strip is lifted": 0.29999999999999993}{"“Calls to remove the army from Gaza..!”\n\n Haaretz newspaper said, citing Israeli sources, that the army is urging Netanyahu to remove the forces from Gaza, claiming that a major achievement has been achieved.": 0.6}{"The Al-Qassam Mujahideen were able to trap an armored Zionist force in a minefield prepared in advance at the Nabulsi Junction, southwest of Gaza City. Immediately upon the armored force’s arrival at the place, it was blown up, leaving the force dead and wounded. Our Mujahideen monitored the helicopter landing to evacuate them.": 0.4}{"We prepare with you tomorrow. Thank you to everyone who did not forget Gaza 🇵🇸🐏": 0.5}{"Iranian pilgrims raise the flag of Palestine on the Day of Arafat 🇵🇸🇮🇷": 0.6}{"In a statement by “Abu Ubaida,” he calls on the world on the Day of Arafah to remember the people of Gaza, whose blood is bleeding like waterfalls": 0.5}{"Hebrew sources: Scenes of the large fire near Kibbutz Yaron in northern occupied Palestine, which threatens neighboring settlements, after Hezbollah bombing.": 0.5}{"Sirens sound in Metula, northern Palestine.": 0.5}{"Al-Qassam Brigades: Our mujahideen were able to blow up a tunnel eye that had been booby-trapped in advance by a Zionist foot force, leaving its members dead and wounded east of the Zaytoun neighborhood in Gaza City.": 0.4}{"Fires in Kfar Sold, northern Palestine, as a result of rocket fire from Lebanon.": 0.5}{"Scenes documenting the moment rockets were fired from northern Gaza towards the occupied town of Ashkelon": 0.6}{"The occupation announces that 11 soldiers were injured by Palestinian resistance bullets in Gaza 🇵🇸": 0.5}{"Northern occupied Palestine\n\n The Zionist army introduces its new weapon (the catapult) to the war with Lebanon": 0.7}{"Northern occupied Palestine\n\n The Zionist army introduces its new weapon (the catapult) to the war with Lebanon": 0.7}{"Northern occupied Palestine\n\n The Zionist army responds to the bombing of the settlements in the north with a bow and an arrow": 0.6}{"Turkish President Recep Tayyip Erdogan: Spain’s decision to recognize Palestine is very important, and we must expand the scope of recognition of the State of Palestine around the world": 0.7}{"Leader of the Yemeni Ansar Allah movement, Mr. Abdul Malik Al-Houthi:: \n\n The massacre committed by the Zionist enemy in the Nuseirat camp was carried out with American participation\n\n - The naval pier established by American forces on the Gaza coast was used in the attack on Nuseirat": 0.3}{"Launching a new Gaza Now account on Instagram here: https://www.instagram.com/nowgnna": 0.6}{"Northern occupied Palestine": 0.6}{"Dozens of missiles launched from Lebanon falling on occupied Palestine 🇱🇧🇵🇸": 0.5}{"Dozens of missiles were launched from Lebanon towards occupied Palestine 🇵🇸🇱🇧": 0.6}{"To clarify... the cost of sacrifice in Gaza 🇵🇸\nAl-Kharaf 1100 + the commission of the intermediary who helps deliver the money to us due to the lack of liquidity in Gaza. We offer this work purely for the sake of God, without any compensation, voluntarily, and this work is fully documented in Gaza now 🐏\nFor anyone who would like to donate money, or make an Eid sacrifice, which is being implemented by the Gaza Now team in Gaza, contact us here @GazaSupport": 0.8}{"The sirens did not stop in northern occupied Palestine as a result of Hezbollah attacks": 0.5}{"Sirens sound in 15 Zionist settlements, including Kiryat Shmona in northern occupied Palestine, after a drone attack from Lebanon.": 0.4}{"Hamas: The movement showed the positivity required to reach a comprehensive and satisfactory agreement based on the just demands of our people.\n The demands are to stop the aggression, complete withdrawal from the Gaza Strip, the return of the displaced, reconstruction, and a serious deal for the prisoners. \n _ The movement dealt positively and responsibly with the latest proposal and all proposals for a ceasefire and the release of detainees.\n The movement agreed to the proposal it received from the mediators on May 5, while Netanyahu responded by attacking #Rafah. \n The movement expressed a positive position on Biden’s speech, while it only heard from Netanyahu the continuation of the war of extermination.\n - The world did not hear any welcome or approval from Israel regarding the Security Council resolution that the movement welcomed\n\n -The Netanyahu government continued to reject any permanent ceasefire, in contradiction with the Security Council resolution and the Biden initiative.\n -Blinken talks about Israel’s approval of the latest proposal, while we have not heard this approval from any Israeli official.\n -Blinken's positions that try to exonerate the occupation are a continuation of the American policy of complicity in the brutal war of extermination.\n We call on Blinken and the Biden administration to put pressure on the occupation government that is determined to complete the mission of killing and extermination.": 1}{"fires in northern occupied Palestine resulted from missiles fired by Hezbollah": 0.6}{"Hezbollah: The air defense unit attacked an enemy Zionist warplane that violated Lebanese airspace, and fired a surface-to-air missile at it, forcing it to retreat towards occupied Palestine.": 0.3}{"Israel is not a state, but rather a gang that includes mercenaries looking for money from several countries around the world, and participating in the killing of Palestinians to steal its resources. These mercenaries, terrorist pigs, will soon have their end, and their governments must hold their terrorist sons accountable instead of describing others and giving lessons to the owners of the land the great people of Palestine.": 0.4}{"The Martyr Izz al-Din al-Qassam Brigades mourns the senior leader of the Islamic Resistance in Lebanon\n Martyr Mujahid Commander/Talib Sami Abdullah “Hajj Abu Talib”\n And his brothers who died as martyrs on the road to Jerusalem yesterday, Tuesday 05 Dhu al-Hijjah 1445 AH corresponding to 06/11/2024 AD;  In a treacherous Zionist raid on a building in the town of Joya, south of Lebanon.\n Al-Qassam Brigades praises the pivotal role of the martyr “Abu Talib” in supporting the Palestinian people and their resistance during the Al-Aqsa Flood Battle.  And his major role in the resistance front against the Zionist occupation over many years.\n Martyr Izz al-Din al-Qassam Brigades - Palestine\n Wednesday 06 Dhu al-Hijjah 1445 AH \n Corresponding to 06/12/2024 AD": 0.19999999999999996}{"Al-Quds Brigades: We bombed, with a barrage of missiles, a command center belonging to the occupation on the supply line to the Netzarim axis, south of Gaza City.": 0.6}{"For anyone who would like to donate money, or make an Eid sacrifice, which is being implemented by the Gaza Now team in Gaza, contact us here @GazaSupport": 0.7}{"Famine strikes Gaza again... Children suffer from malnutrition and extreme weakness as a result of the siege and the Israeli war of starvation": 0.19999999999999996}{"Al-Aqsa Martyrs Brigades: We bombed with a barrage of regular mortar shells the transmission towers at the Zionist Nahal Oz site, east of Gaza City.": 0.6}{"Head of the “Mate Asher” Settlement Council: \n\n The settlers of northern occupied Palestine are trembling as Hebrew channels broadcast recipes for preparing food and pies.\n\n - It seems that the northern region does not belong to “Israel”.\n\n The truth is that the Netanyahu government is very far from reality here.": 0.4}{"Gaza Now channel participates in providing gifts and toys to children as Eid Al-Adha approaches in Gaza, which is being subjected to genocide 🇵🇸": 0.4}{"غزة تدخل في مجاعة حقيقية .\nGaza is entering into a real famine.": 0.6}{"America repeats statements that it is waiting for special approval from Sinwar in Gaza on the ceasefire proposals, and it wants to lure him into agreeing so that he appears again in an attempt to carry out a trick and assassinate him. Hamas said that it agreed to a ceasefire, which caused embarrassment to America and the Israeli occupation in front of the world that is following developments Events in the Palestinian territories 🇵🇸": 0.4}{"Hezbollah: Scenes from the operation to target a building housing enemy army soldiers in the “Metula” settlement in northern occupied Palestine.": 0.4}{"A harsh life among the rubble in Khan Yunis, which was destroyed during the ongoing genocidal war": 0.5}{"Rockets with a number of aircraft marching over rapists in northern occupied Palestine and sirens sounded with a number of explosions heard": 0.6}{"Pictures of the Nazi Israeli terrorist pigs that were killed in Rafah, south of the Gaza Strip.": 0.4}{"The Israeli Nazi occupation officially announces the killing of 4 pigs, including an officer, and the wounding of 5 others in Rafah, south of the Gaza Strip.": 0.5}{"Hezbollah: Scenes from the targeting of a military intelligence building by the Israeli enemy army in the settlement of Miskaf General, in northern occupied Palestine.": 0.5}{"23 soldiers were killed and wounded in Rafah, south of the Gaza Strip, and the resistance surrounded the forces that arrived to rescue the soldiers trapped under the rubble in the meantime 🇵🇸✌️🔥": 0.3}{"Violent clashes in Rafah, south of the Gaza Strip, now, and the resistance is surrounding the forces that arrived to rescue the soldiers from under the buildings that were blown up in the ambush 🇵🇸✌️🔥": 0.3}{"The flood of Al-Aqsa has not and will not end, and the resistance confirms that it will not allow the settlers to return to the settlements surrounding the Gaza Strip 🇵🇸🔥✌️": 0.7}{"Breaking : A large number of deaths among the ranks of the occupation in a specific operation by the Palestinian resistance in Rafah, south of the Gaza Strip, a short while ago 🇵🇸": 0.4}{"Israeli Finance Minister Smotrich: \n\n Gantz's resignation achieved what Sinwar, Nasrallah, and Iran aimed for": 0.4}{"This is what happened to the Al-Fahd armored vehicle after it was hit by a 105 shell in Rafah, south of Gaza 🇵🇸": 0.6}{"The commander of the Gaza Division in the Israeli army announces his resignation from his position, explaining that the reason is his inability to protect the Gaza perimeter": 0.6}{"Gantz decides to resign from the war government.. \n\n\n Gantz said that he would announce his resignation from the Israeli war government in light of Netanyahu’s failure to respond to his decisions to conclude an agreement stipulating the release of prisoners in exchange for a ceasefire.": 0.5}{"Urgently, the Qassam Brigades are targeting a hostile Apache aircraft with a Sam 7 anti-aircraft missile in the Rafah Sea skies south of Gaza Strip.": 0.5}{"Once again, sirens sound for the fifth time in Avivim and Daraun in northern occupied Palestine": 0.6}{"the Qassam Brigades are targeting a hostile Apache aircraft with a Sam 7 anti-aircraft missile in the Rafah Sea skies south of Gaza City.": 0.5}{"Al-Qassam Brigades: We sniped a soldier from the occupation army in the Tal Zorob area, west of the city of Rafah, south of the Gaza Strip 🇵🇸": 0.6}{"The Israeli Nazi occupation officially announces the killing of the pig, Eliran Mizrahi, who participated in the slaughter of defenseless Palestinians in Gaza. According to what was stated in the statement, the pig soldier was killed after he shot himself as a result of psychological disorders after his return from Gaza.": 0.09999999999999998}{"For the first time since the beginning of the Gaza battles\n\nFalaq 2 missile \nIranian made \nDiameter 333 mm \nIts length is 1.8 meters \nIts explosive head weighs 120 kg \nIts range is 11 km\nIts speed exceeds the speed of sound\n300 meters radius of its circle of influence\nFalaq 2 launcher contains 3 missiles": 0.6}{"Hizb allah:\n\n- We bombed the headquarters of the Sahel Battalion in the “Beit Hilal” barracks with a Falaq 2 missile launcher. \n\n- The operation comes in support of our steadfast people in Gaza and in support of their resistance, and in response to the enemy’s attacks against the steadfast southern villages and safe houses and the recent attack on the towns of Markaba and Aitaroun.\n\n\n- We targeted with missile weapons a building used by Israeli enemy soldiers in the “Kafryoval” colony.\n\n- “The targeting comes in support of our steadfast Palestinian people in the Gaza Strip and in support of their brave and honorable resistance, and in response to the Israeli enemy’s attacks on the steadfast southern villages and safe homes, especially in the town of Khiam.”": 1}{"Al-Qassam Brigades spokesman, Abu Ubaida:\n\n- What the enemy carried out in the Nuseirat area is a complex war crime, and the first to be harmed by it were his prisoners\n\nBy committing horrific massacres, the enemy was able to free some of his captives, but at the same time he killed some of them during the operation\n\nThe operation will pose a great danger to the enemy prisoners and will have a devastating impact on their conditions and lives": 0}{"Al-Qassam Brigades: Our mujahideen were able to detonate a “thunder” anti-personnel device against an Israeli force inside a house, killing and wounding its members, and a helicopter was spotted landing to evacuate them east of the Zaytoun neighborhood in Gaza City🇵🇸": 0.5}{"A message from Nuseirat camp in the middle of the Gaza Strip after the Nazi-Israeli occupation committed a massacre against defenseless Palestinians.\n\"We are steadfast. We will not surrender and we will not relent. We will live in freedom or die with our dignity.\"\nGaza, its resistance and its people are a source of pride for the whole world.": 0.6}{"A Palestinian witnessed the massacre committed by the Nazi-Israeli occupation in the Nuseirat camp in the central Gaza Strip.\nHe said: A truck arrived with humanitarian aid and clothes on board, and suddenly 10 soldiers got out of the middle of the truck and fired three bullets at him, one in my chest and two in my feet. The random shelling began and I looked around, “I saw dozens of citizens on the ground, including people with their heads cut off.”\n“A truck came from the American seaport that the occupation established in the Gaza Sea, and it helped the American terrorist forces carry out the terrorist attack against the defenseless Palestinians in the Nuseirat camp in the central Gaza Strip.”": 0.8}{"The miracle of a Palestinian child in the Nuseirat massacre in the middle of the Gaza Strip. His martyrdom was announced, and in the last moments he moved his hand and returned to life again 🇵🇸": 0.5}{"The Israeli Nazi occupation released 4 Israeli prisoners who were being held by the Palestinian resistance in the Nuseirat camp in the central Gaza Strip, and in return 18 pigs were lost during the confrontations.\nWhat is this achievement, Netanyahu and Gallant?": 0.3}{"The first moments of the massacre committed by the Nazi Israeli occupation in cooperation with the United States of America in the Nuseirat camp in the central Gaza Strip, which resulted in the death and injury of 600 Palestinians.": 0.3}{"Everything that “America, the leaders of terrorism in the region” said, we congratulate the liberation of the Israeli prisoners in which the terrorist American army participated, while they did not mention even a single word about the massacre committed by the Israeli occupation, killing and wounding 600 Palestinians in the Nuseirat camp in the middle of the Gaza Strip.": 0.29999999999999993}{"The Nazi Israeli occupation used an aid truck during its storming of the Nuseirat camp and committed a major massacre that resulted in the martyrdom of more than 300 Palestinians through the port that was established by the United States of America, which cooperated in committing this major massacre in the middle of the Gaza Strip.": 0.29999999999999993}{"America participates in a major massacre carried out by the Israeli occupation army in the Nuseirat camp through the seaport that was established on the shore of the Nuseirat Sea in Wasit, Gaza, where the occupation recently committed a massacre that claimed the lives of 100 martyrs after storming the camp through the American seaport, which America claimed was a seaport.  To facilitate the arrival of aid to Gaza, it turned out to be a military port used to transport weapons to kill defenseless Palestinians.": 0.3}